In [38]:
from sqlalchemy import create_engine, text
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
database_name = 'scooters'

connection_string = f'postgresql://postgres:postgres@localhost:5432/{database_name}'

engine = create_engine(connection_string)

In [3]:
query = '''
SELECT companyname, SUM(tripduration)
FROM trips
WHERE tripduration IS NOT NULL
GROUP BY companyname'''

pd.read_sql(query, con = engine)

     companyname           sum
0           Bird  2.046202e+06
1  Bolt Mobility  3.082150e+07
2         Gotcha  3.380278e+04
3           JUMP  2.110013e+05
4           Lime  3.507335e+06
5           Lyft  1.936370e+06
6           SPIN  9.005750e+05

In [4]:
query = '''
SELECT *
FROM trips
'''

trips = pd.read_sql(query, con = engine)

In [5]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  datetime64[ns]
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 69.0+ MB

In [7]:
query = '''
SELECT *
FROM scooters
LIMIT 5'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-09 09:30:12,36.1199,-86.7535,Powered7179eba6-2522-5423-b6c8-7c6b74ce00f6,Powered,0.0,scooter,0.06,Jump
1,2019-07-09 09:30:12,36.1198,-86.7535,Powered743768be-96db-5dac-86f3-a99dacad31b8,Powered,30.0,scooter,0.06,Jump
2,2019-07-09 09:30:12,36.1201,-86.7532,Powered4e6cf747-22dc-5d50-8dbd-830d6ab8ca71,Powered,0.0,scooter,0.06,Jump
3,2019-07-09 09:30:12,36.1203,-86.7534,Powered70e93b4e-0895-59ac-b16d-1b53f04c1dc3,Powered,94.0,scooter,0.06,Jump
4,2019-07-09 09:30:12,36.1197,-86.7529,Powered05fee9e1-d132-5e4f-88cd-153058d391fa,Powered,0.0,scooter,0.06,Jump

In [18]:
query = '''
SELECT *
FROM scooters
WHERE latitude IS NULL
    OR longitutde IS NULL'''

pd.read_sql(query, con = engine)

Empty DataFrame
Columns: [pubdatetime, latitude, longitude, sumdid, sumdtype, chargelevel, sumdgroup, costpermin, companyname]
Index: []

In [20]:
trips.startdate.min()

datetime.date(2019, 5, 1)

In [21]:
trips.startdate.max()

datetime.date(2019, 7, 31)

In [23]:
query = '''
SELECT min(pubdatetime)
FROM scooters'''

pd.read_sql(query, con = engine)

                      min
0 2019-05-01 00:01:41.247

In [24]:
query = '''
SELECT max(pubdatetime)
FROM scooters'''

pd.read_sql(query, con = engine)

                  max
0 2019-07-31 23:59:57

In [28]:
query = '''
SELECT COUNT(*)
FROM scooters
'''

pd.read_sql(query, con = engine)

      count
0  73414043

In [29]:
#- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [30]:
query = '''
SELECT *
FROM scooters
LIMIT 1'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-09 09:30:12,36.1199,-86.7535,Powered7179eba6-2522-5423-b6c8-7c6b74ce00f6,Powered,0.0,scooter,0.06,Jump

In [31]:
trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [32]:
#ANSWER: both tables are using 24-hour time

In [33]:
#- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [34]:
#ANSWER: The sumdgroup column in the scooters table are: “bicycle”, "Scooter", and “scooter”.
#The only values of interest are the "scooter" and "Scooter" values.

In [35]:
query = '''
SELECT DISTINCT sumdgroup
FROM scooters'''

pd.read_sql(query, con = engine)

  sumdgroup
0   Scooter
1   bicycle
2   scooter

In [36]:
#- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [39]:
query = '''
SELECT 
    MIN(latitude) AS min_lat,
    MAX(latitude) AS max_lat,
    MIN(longitude) AS min_lon,
    MAX(longitude) AS max_lon
FROM scooters;
'''

with engine.connect() as connection:
    scoots = pd.read_sql(text(query), con = connection)

scoots

   min_lat       max_lat    min_lon  max_lon
0      0.0  3.609874e+06 -97.443879      0.0

ANSWER: The max latitude is too large. Minimum longitutde is the only correct value.

What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [42]:
trips.tripduration.min()

-19.3582666667

In [43]:
trips.tripduration.max()

512619.0

In [44]:
trips.tripdistance.max()

31884482.6476

In [45]:
trips.tripdistance.min()

-20324803.8

ANSWER: The minimum values for trip duration and trip distance are questionable because they're negative. The trip distance maximum also indicates the trip is around 6000 miles which is questionable as well. The trip duration max is around 8500 hours which is also questionable.

Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [46]:
query = '''
SELECT DISTINCT companyname
FROM scooters'''

pd.read_sql(query, con = engine)

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [48]:
trips.companyname.unique()

array(['Bird', 'Lyft', 'Lime', 'Bolt Mobility', 'SPIN', 'Gotcha', 'JUMP'],
      dtype=object)

ANSWER: The company names have different capitalizations in each table. 'Bolt' is titled 'Bolt Mobility' in the trips table.